--[[ 奇穴: [扬戈][神勇][大漠][击水 or 龙驭][驰骋][牧云][风虎][战心][渊][夜征][龙血][虎贲]
秘籍:
穿云  1调息 1会心 2伤害
龙吟  1调息 3伤害
龙牙  1会心 3伤害
突    1消耗 1距离 2伤害
灭    1调息 1会心 2伤害
战八方 1目标个数 1范围 2伤害
断魂刺 2调息 2伤害

如果点了[龙驭], 上马之后龙驭不到3层就动起来, 到3层站桩打
--]]
--load("Macro/Lib_PVP.lua")
load("Macro/Lib_Base.lua")
load("Macro/Lib_Tools.lua")
load("Macro/Lib_Auto.lua")
--变量表
local v = {}
local f = {}

local road = {
    {818, 1381, 1206400},
    {818, 1381, 1206400},
    {916, 1479, 1206400},
    {1028, 1591, 1206400},
    {1140, 1700, 1206400},
    {1252, 1804, 1206400},
    {1350, 1895, 1206400},
    {1462, 1999, 1206400},
    {1574, 2103, 1206400},
    {1686, 2209, 1206400},
    {1784, 2307, 1206400},
    {1896, 2419, 1206656},
    {2006, 2529, 1206912},
    {2098, 2627, 1206912},
    {2178, 2758, 1206976},
    {2192, 2906, 1206912},
    {2088, 3018, 1206912},
    {1990, 3109, 1206912},
    {1878, 3213, 1206912},
    {1760, 3312, 1206912},
    {1655, 3396, 1206912},
    {1535, 3492, 1206912},
    {1430, 3579, 1206912},
    {1318, 3683, 1206912},
    {1276, 3722, 1206912},
    {1276, 3722, 1206912},
    {1198, 3806, 1206976},
    {1101, 3926, 1206912},
    {1027, 4040, 1206912},
    {1005, 4191, 1206912},
    {1000, 4345, 1206912},
    {1005, 4499, 1206912},
    {1046, 4628, 1206912},
    {1116, 4764, 1206912},
    {1172, 4908, 1206912},
    {1221, 5034, 1206912},
    {1277, 5178, 1206912},
    {1333, 5322, 1206912},
    {1382, 5448, 1206912},
    {1438, 5592, 1206912},
    {1494, 5736, 1206912},
    {1543, 5862, 1206912},
    {1599, 6006, 1206912},
    {1655, 6150, 1206912},
    {1704, 6276, 1206912},
    {1760, 6420, 1206912},
    {1816, 6564, 1206912},
    {1862, 6711, 1206912},
    {1897, 6844, 1206848},
    {1937, 6995, 1206720},
    {1976, 7123, 1206592},
    {2023, 7268, 1206464},
    {2059, 7420, 1206400},
    {2087, 7553, 1206400},
    {2115, 7705, 1206400},
    {2123, 7857, 1206400},
    {2131, 8009, 1206400},
    {2138, 8142, 1206400},
    {2146, 8294, 1206400},
    {2154, 8446, 1206400},
    {2161, 8579, 1206400},
    {2169, 8731, 1206400},
    {2176, 8864, 1206400},
    {2179, 9016, 1206400},
    {2179, 9168, 1206400},
    {2179, 9306, 1206400},
    {2179, 9466, 1206400},
    {2179, 9626, 1206400},
    {2179, 9786, 1206528},
    {2179, 9926, 1206528},
    {2179, 10083, 1206528},
    {2179, 10237, 1206848},
    {2179, 10367, 1207040},
    {2179, 10520, 1207040},
    {2179, 10673, 1207040},
    {2179, 10806, 1207040},
    {2179, 10958, 1207040},
    {2179, 11110, 1207040},
    {2179, 11243, 1206784},
    {2179, 11393, 1206400},
    {2187, 11545, 1206400},
    {2211, 11697, 1206400},
    {2232, 11830, 1206400},
    {2256, 11982, 1206400},
    {2277, 12115, 1206400},
    {2301, 12267, 1206400},
    {2325, 12419, 1206400},
    {2346, 12552, 1206400},
    {2370, 12704, 1206400},
    {2394, 12856, 1206400},
    {2415, 12989, 1206400},
    {2439, 13141, 1206400},
    {2463, 13293, 1206400},
    {2484, 13426, 1206464},
    {2508, 13578, 1206528},
    {2532, 13730, 1206656},
    {2553, 13863, 1206784},
    {2577, 14012, 1206784},
    {2593, 14163, 1206784},
    {2607, 14291, 1206784},
    {2623, 14443, 1206784},
    {2639, 14594, 1206784},
    {2653, 14727, 1206784},
    {2669, 14879, 1206784},
    {2685, 15031, 1206784},
    {2701, 15183, 1206784},
    {2715, 15316, 1206784},
    {2731, 15468, 1206784},
    {2747, 15620, 1206784},
    {2761, 15753, 1206784},
    {2777, 15905, 1206784},
    {2793, 16057, 1206784},
    {2807, 16190, 1206784},
    {2823, 16342, 1206784},
    {2839, 16494, 1206784},
    {2849, 16646, 1206784},
    {2856, 16779, 1206784},
    {2863, 16912, 1206784},
    {2863, 16912, 1206784},
    {2863, 16912, 1206784},
    {2863, 16912, 1206784},
    {2863, 16912, 1206784}
}

local counter = 1

local step = 0;

local buffid = 0

local allMaps = {
    "和平谷·一",
    "和平谷·二",
    "和平谷·三",
    "和平谷·四",
    "和平谷·五",
    "和平谷·六",
    "和平谷·七",
    "和平谷·八",
    "和平谷·九",
    "和平谷·十",
    "和平谷·十一",
    "和平谷·十二",
    "和平谷·十三",
    "和平谷·十四",
    "和平谷·十五",
    "和平谷·十六",
    "和平谷·十七",
    "和平谷·十八",
    "和平谷·十九",
    "和平谷·二十",
}

local mapIndex = 1
local step = 0
local counter = 1

--主循环
function Main(g_player)
    if map() == "和平谷" then
        if step == 0 then
            resetAutoMove()
            step = 1
        end
        if step == 1 then
            if autoMove(road) then
                step = 2
            end
        end

        if step == 2 then
            if life() < 0.1 then
                clickButton("Topmost/RevivePanel/WndContainer_BtnList/Btn_Cancel/")
            end
            local nid = npc("名字:大龙")
            if nid == 0 then
                step = 3
                resetAutoMove()
            else
                if buff("骑御") then
                    cast(54)
                end
                if xdis(nid) > 35 then
                    local x, y, z = pos()
                    if math.abs(x - 2863) > 200 or math.abs(y - 16912) > 200 then
                        moveto(2863, 16912, 1206784)
                    else
                        moveto(xpos(nid))
                    end
                end




                --if xlife(nid) < 0.95 then
                    if notarget() then
                        settar(nid)
                    end

                    g_auto_play[xmountname(id())]()
                --end
            end
        end

        if step == 3 then
            if life() < 0.1 then
                clickButton("Topmost/RevivePanel/WndContainer_BtnList/Btn_Cancel/")
            end
            if autoMove(road, true) then
                step = 4
            end
        end

        if step == 4 then
            local nid = npc("名字:使役")
            if nid ~= 0 then
                if moveto(xpos(nid)) then
                    step = 5
                    counter = 1
                end
            end
        end

        if step == 5 then
            local nid = npc("名字:使役")
            if nid ~= 0 then
                if counter == 30 then
                    interact(nid)
                end

                if counter == 60 then
                    dialog("我要出去！")
                end

                if counter > 80 then
                    counter = 1
                end
            end
            counter = counter + 1
        end
    end

    if step == 5 and "扬州" == map() then
        if mapIndex == 20 then
            mapIndex = 1
        else
            mapIndex = mapIndex + 1
        end
        step = 0
        counter = 1
    end
    if step == 0 and "扬州" == map() then
        local nid = npc("名字:使役")
        if nid ~= 0 then
            if moveto(xpos(nid)) then
                counter = counter + 1

                if counter == 20 then
                    interact(nid)
                end

                if counter == 40 then
                    dialog("这就去")
                end

                if counter > 60 then
                    output("即将前往 " .. allMaps[mapIndex])
                    dialog(allMaps[mapIndex])
                end

                if counter > 100 then
                    counter = 1
                end
            end
        end
    end
end

